---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForWidth
source: html/6e341285-fabb-2599-9510-edd956fcd829.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForWidth Property

Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]).

## Syntax (C#)
```csharp
public static FailureDefinitionId LiningThicknessIsLargeForWidth { get; }
```